In [2]:
import pandas as pd

In [3]:
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## Dataframe
## create a Dataframe from a dictionary oof list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [11]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Alexy','Age':32,'City':'Bangalore'},
    {'Name':'Jack','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Alexy   32  Bangalore
3   Jack   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [12]:
df.head()

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Alexy   32  Bangalore
3   Jack   32  Bangalore

In [13]:
df.tail()

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Alexy   32  Bangalore
3   Jack   32  Bangalore

In [14]:
df['Name']

0    Krish
1     John
2    Alexy
3     Jack
Name: Name, dtype: object

In [15]:
df.loc[0]

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [22]:
df.index=['a','b','c','d']

In [23]:
df

    Name  Age       City
a  Krish   32  Bangalore
b   John   34  Bangalore
c  Alexy   32  Bangalore
d   Jack   32  Bangalore